//HERC03S JOB MSGCLASS=H,NOTIFY=HERC01,
//            USER=HERC01,PASSWORD=CUL8TR
//CREATE EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD *
13009REED,TINA              A0842000426072100    74
15174HANDJANY,HAIDEH        H0229000220022900    71
17337BUTERO,MAURICE         H0501000434050100    63
19449LAFER,BRUCE            A0706000819050000    52
21661LEE,SUI                A0390170303030017    76
23821COOPER,LUCY            L0745000730070000    64
25980NELSON,LAWRENCE        L0513000217052300    78
28138KRUSKIS,SONIA          A0346000510034600    59
30295CHEN,YIN               H0295000514010000    81
32451SIMPKINS, KEVIN        L0388000321038806    76
34605PORTER,MICHELLE        A0627500128042700    65
36759DECICCO,RICHARD        A0255000619010000    71
38912ABREU,JUANITA          H0732001030070000    80
41063HIGH,CAROL             L0311000521031100    82
43214ENGLISH,REYNOLDS       A0443000228043300    82
45363LEE,BOHYON             A0515000214050000    79
47512THOMPSON,STANLEY       H6407503070064075    66
49659VALDEZ,FABIO           L0706000430070600    71
51805AMATO,ROBERT           A0466000417015000    63
53950RIZZUTO,JAMES          A0693000822000000    81
56094SCHWARTZ,MICHAEL       H1037000605050000    67
58238RUFINO,CARLOS          L0673000520047300    64
60380MORLEY,JOHN            A0786000514078600    71
62521BREVIL,JAMES           H0812000314081200    55
64660FALCONER,EDWARD        L1080000227008000    74
66799MARTIN,KATHLEEN        L0895000129089500    65
68937YEUNG,SUK              A0517000816050000    49
71074PAUL,MARINA            A0441000414034100    80
73210FRADIN,SHIRLEY         L0668000728066800    56
75344BURNS,JEFFREY          L0706000226070000    57
77478KATZ,HAL               A0485000406038500    64
79610WRIGHT,DONNA           H0926000901092000    75
81742CUOMO,DONNA            L0900000313090000    69
83872LOPEZ,ANNA             A0679000716010000    80
86002ALEXANDER,LISA         A0402000623030200    73
88130GOLDBERG,LORI          H0987000524095000    67
92057HOFMANN,PATRICIA       H0737000315040000    77
92384PUGH,CLIFFORD          A0750000423075000    80
94509FERRIS,LAURA           A0135000815013500    73
96633BERGIN,MICHAEL         L1608000116100000    74
/*
//SYSUT2   DD DSN=HERC01.POLYFILE,DISP=(NEW,CATLG),
//            UNIT=3390,VOL=SER=PUB013,
//            SPACE=(TRK,(5,1)),    
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=800,DSORG=PS)
//SYSIN    DD DUMMY
//
