//HERC01P JOB MSGCLASS=H,NOTIFY=HERC01,
//            USER=HERC01,PASSWORD=CUL8TR
//*** 
//***  PRINT ISAM DATASET
//***
//PRTIS  EXEC PGM=IEBISAM,PARM='PRINTL,N'
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DSN=HERC01.POLYISAM,DISP=SHR,
//            DCB=DSORG=IS
//SYSUT2   DD SYSOUT=*
//
