000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID.     'HEMV2'.
000003 ENVIRONMENT DIVISION.
000004 DATA DIVISION.
000005 PROCEDURE DIVISION.
000006 00-MAIN.
000007     DISPLAY 'Hello MVS 2!'.
000008     STOP RUN.