//HEHI JOB (COBOL), 
//             'Asm HI',
//             CLASS=A,
//             MSGCLASS=A,
//             REGION=8M,TIME=1440,
//             MSGLEVEL=(1,1),
//  USER=HERC01,PASSWORD=CUL8TR
//ASM EXEC ASMFCL,PARM.ASM='OBJ,NODECK',MAC1='SYS2.MACLIB'
//ASM.SYSIN DD DSN=HERC01.CODE.ASM(HELLOA),DISP=SHR                   
//LKED.SYSLMOD DD DSN=HERC01.CODE.LOADLIB(HELLOA),DISP=(OLD,CATLG)    
//
