//HECALLE JOB (COBOL), 
//             'Hello',
//             CLASS=A,
//             MSGCLASS=A,
//             REGION=8M,TIME=1440,
//             MSGLEVEL=(1,1),
//  USER=HERC01,PASSWORD=CUL8TR
//COBOL EXEC COBUCL                                                     
//COB.SYSIN DD DSN=HERC01.CODE.SOURCE(CALLEE),DISP=SHR             
//LKED.SYSLMOD DD DSN=HERC01.CODE.LOADLIB(CALLEE),DISP=SHR        


