//HERCH1 JOB MSGCLASS=A,MSGLEVEL=(1,1),NOTIFY=HERC01,                  
//             USER=HERC01,PASSWORD=CUL8TR                                
//GCCPRC  EXEC  PROC=GCCCL,OUTFILE='HERC01.TEST.LOADLIB(HASHME)',
//             INFILE='HERC01.TEST.CNTL(HASHME)'
//COMP.SYSPRINT DD SYSOUT=*,DCB=(LRECL=132,BLKSIZE=132)
//
