//HEUCPBK JOB MSGCLASS=A,NOTIFY=HERC01,
//            USER=HERC01,PASSWORD=CUL8TR
//KSDSL  EXEC COBUCLG,
//            PARM.COB='LOAD,SIZE=2048K,BUF=1024K,LIB'
//COB.SYSLIB DD DSN=HERC01.TEST.SOURCE,DISP=SHR
//COB.SYSPUNCH DD SYSOUT=B
//COB.SYSIN DD DSN=HERC01.TEST.SOURCE(USECPYBK),DISP=SHR
//GO.SYSOUT DD SYSOUT=*
//
