//HECPYBK JOB (COBOL), 
//             'Copy Book',
//             CLASS=A,
//             MSGCLASS=H,
//             REGION=8M,TIME=1440,
//             MSGLEVEL=(1,1),
//  USER=HERC01,PASSWORD=CUL8TR
//IEBGENER EXEC PGM=IEBGENER,REGION=128K
//SYSIN    DD  DUMMY
//SYSPRINT DD  SYSOUT=A
//SYSUT1   DD  *
000006   01 SQL-PARAMETER-VALUES.
000007      02 WS-SQL PIC X(100).
000008      
/*
//SYSUT2   DD DSN=HERC01.TEST.SOURCE(CPYBK),DISP=OLD
//SYSIN    DD DUMMY
//

