
//HEINCLD1 JOB (COBOL), 
//             'Include',
//             CLASS=A,
//             MSGCLASS=H,
//             REGION=8M,TIME=1440,
//             MSGLEVEL=(1,1),
//  USER=HERC01,PASSWORD=CUL8TR
//IEBGENER EXEC PGM=IEBGENER,REGION=128K
//SYSIN    DD  DUMMY
//SYSPRINT DD  SYSOUT=A
//SYSUT1   DD  *
000037 EXEC-SQL-SELECT.
000038      DISPLAY 'IN INCLUDE'. 
000039      DISPLAY WS-SQL.
000040      
/*
//SYSUT2   DD DSN=HERC01.TEST.SOURCE(INCLD),DISP=OLD
//SYSIN    DD DUMMY
//

