//HERCALL5 JOB (COBOL),
//             'Call CALL',
//             CLASS=A,
//             MSGCLASS=A,
//             REGION=8M,TIME=1440,
//             MSGLEVEL=(1,1),
//  USER=HERC01,PASSWORD=CUL8TR
//STEP01 EXEC PGM=MAIN 
//STEPLIB DD DSN=HERC01.TEST.LOADLIB,DISP=SHR 
//SYSPRINT DD SYSOUT=* 
//SYSOUT DD SYSOUT=A 
//
