//HERCALL7 JOB MSGCLASS=A,NOTIFY=HERC01,
//            USER=HERC01,PASSWORD=CUL8TR
//MAIN  EXEC COBUCLG,
//            PARM.COB='LOAD,SIZE=2048K,BUF=1024K,LIB'
//COB.SYSLIB DD DSN=HERC01.TEST.SOURCE,DISP=SHR
//COB.SYSPUNCH DD SYSOUT=B
//COB.SYSIN DD DSN=HERC01.TEST.SOURCE(MAIN),DISP=SHR
//LKED.SYSLIN DD
//         DD DSN=HERC01.TEST.OBJ(CALLED),DISP=SHR
//GO.SYSOUT DD SYSOUT=*
//
