//COBULG PROC SOUT='*'                                                  00000100
//LKED  EXEC  PGM=IEWL,PARM='LIST,XREF,LET'                             00000200
//SYSLIN DD DDNAME=SYSIN                                                00000300
//SYSLMOD DD DSNAME=&GODATA(RUN),DISP=(NEW,PASS),UNIT=SYSDA,            00000400
//             SPACE=(1024,(50,20,1))                                   00000500
//SYSLIB DD DSNAME=SYS1.COBLIB,DISP=SHR                                 00000600
//SYSUT1 DD UNIT=(SYSDA,SEP=(SYSLIN,SYSLMOD)),SPACE=(1024,(50,20))      00000700
//SYSPRINT  DD SYSOUT=&SOUT                                             00000800
//GO  EXEC PGM=*.LKED.SYSLMOD,COND=(5,LT,LKED)                          00000900
