//HERPRT JOB MSGCLASS=A,NOTIFY=HERC01,
//            USER=HERC01,PASSWORD=CUL8TR
//*** 
//***  PRINT DATASET
//***
//STEP1    EXEC PGM=IEBGENER
//SYSPRINT DD  SYSOUT=A
//SYSIN    DD  DUMMY
//SYSUT1   DD  DSNAME=HERC01.TEST.CNTL(CARS),DISP=SHR
//SYSUT2   DD  SYSOUT=A
//SYSUT2   DD SYSOUT=*